src/DataProcessors/МодульОбъектаИМодульМенеджера/МодульОбъектаИМодульМенеджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МодульОбъектаИМодульМенеджера</name>
</mdclass:DataProcessor>

src/Enums/ВидыДоговоров/ВидыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоров</name>
  <enumValues>
    <name>СПоставщиком</name>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Дети/Дети.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Дети</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Родители</name>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/МодульОбъектаИМодульМенеджера/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СоздатьРебенка(Команда)
	СоздатьРебенкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьРебенкаНаСервере()
	
	//пример 1
	Ребенок = Справочники.Дети.СоздатьЭлемент();
	Ребенок.Наименование = "Петя";
	Ребенок.ДатаРождения = '19990101';
	
	СтрокаТЧ = Ребенок.Родители.Добавить();
	СтрокаТЧ.ФИО = "Иванова Алена Юрьевна";
	
	СтрокаТЧ = Ребенок.Родители.Добавить();
	СтрокаТЧ.ФИО = "Иванов Сергей Петрович";
	
	Ребенок.Записать();
	Ребенок.ПервоеСлово();
	
	//пример 2
	Ребенок = Справочники.Дети.СоздатьЭлемент();
	Ребенок.ЗаполнитьДанные();//наш метод
	Ребенок.Записать();//встроенный метод
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоДетей(Команда)
	
	КоличествоДетейНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура КоличествоДетейНаСервере()

	КоличествоЭлементов = Справочники.Дети.КоличествоЭлементов();	
	Сообщить("Количество детей: " + КоличествоЭлементов);

КонецПроцедуры // КоличествоДетейНаСервере()


&НаКлиенте
Процедура Задача1(Команда)
	Задача1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Задача1НаСервере()

	//получить выборку контрагентов
	Выборка = Справочники.Контрагенты.Выбрать();
	
	//обойти выборку в цикле
	Пока Выборка.Следующий() Цикл
		
		//проверка наличия хотя бы одной строки в таб. части Контактная информация
		Если Выборка.КонтактнаяИнформация.Количество() = 0 Тогда
			Продолжить;		
		КонецЕсли; 
		
		//получение объекта
		ТекКонтрагент = Выборка.ПолучитьОбъект();
		
		//вызов метода объекта (в модуле объекта)
		ТекКонтрагент.ЗаполнитьНомераТелефонов();
		
		//запись контрагента
		ТекКонтрагент.Записать();
	
	КонецЦикла; 
	
	Сообщить("Готово. Номера телефонов заполены");
	
КонецПроцедуры


&НаКлиенте
Процедура Задача2(Команда)
	Задача2НаСервере();
КонецПроцедуры


&НаСервере
Процедура Задача2НаСервере()

	Сообщить(Справочники.Контрагенты.КоличествоЭлементов());
	
	Сообщить("Номенклатура: " + ОбщегоНазначенияСервер.КоличествоЭлементов("Номенклатура"));
	
КонецПроцедуры

&НаКлиенте
Процедура Задача3(Команда)
	Задача3НаСервере();
КонецПроцедуры


&НаСервере
Процедура Задача3НаСервере()
	
	//000000002
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("000000002");
	
	ОсновнойДоговор = Справочники.ДоговорыКонтрагентов.ОсновнойДоговорКонтрагента(Контрагент);
	
	Если ОсновнойДоговор.Пустая() Тогда
		Сообщить("Не найдено ни одного договора");
	Иначе
		Сообщить(ОсновнойДоговор.Наименование);
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура Задача4(Команда)
	Задача4НаСервере();
КонецПроцедуры

&НаСервере
Процедура Задача4НаСервере()
	
	Контрагент = Справочники.Контрагенты.НайтиПоКоду("000000002");
	
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Владелец = Контрагент;
	НовыйДоговор.Номер = "157";
	НовыйДоговор.ДатаДоговора = ТекущаяДата();
	НовыйДоговор.ВидДоговора = Перечисления.ВидыДоговоров.СПокупателем;
	НовыйДоговор.ЗаполнитьНаименованиеПоШаблону();
	НовыйДоговор.Записать();
	
КонецПроцедуры
